/*
4.8.c 矩阵的乘法运算
A1 = 
1 2 3
4 5 6

A2 =
1 0 2 3
4 1 5 6
6 8 9 0

说明：


@since 2021/2/16
*/
#include <stdio.h>
int main() {
    int A[2][3] = {{1, 2, 3}, {4, 5, 6}};
    int B[3][4] = {{1, 0, 2, 3}, {4, 1, 5, 6}, {6, 8, 9, 0}};
    int C[2][4] = {{0, 0, 0, 0}, {0, 0, 0, 0}};
    int i, j, k;
    for (i = 0; i < 2; i++) {
        for (j = 0; j < 4; j++) {
            for (k = 0; k < 3; k++) {
                C[i][j] += A[i][k] * B[k][j];
            }
        } 
    }
    // 输出
    for (i = 0; i < 2; i++) {
        for (j = 0; j < 4; j++) {
            printf("%d ", C[i][j]);
        }
        printf("\n");
    }
    return 0;
}